## Dataframe functions: Read file in folder, Read xlsx, Merge data

In [2]:
import pandas as pd

### Read file in folder

In [5]:
#Sometimes you'll get bunch of files in your folder, you can use os.listdir to get all file in the given directory
from os import listdir
listdir('/home/majhihcheng/development/2023_python_train/lesson2')

['num_0.csv',
 'demo.ipynb',
 'num_1.csv',
 'num_2.csv',
 'num_3.csv',
 'num_4.csv',
 'num_5.csv',
 'num_6.csv',
 'num_7.csv',
 'num_8.csv',
 'num_9.csv',
 'num_0.xlsx']

In [6]:
#from list, we only want the csv format data, so we include data name contains csv
data_list = []
for f in listdir('/home/majhihcheng/development/2023_python_train/lesson2'):
    if 'csv' in f:
        data_list.append(f)
data_list

['num_0.csv',
 'num_1.csv',
 'num_2.csv',
 'num_3.csv',
 'num_4.csv',
 'num_5.csv',
 'num_6.csv',
 'num_7.csv',
 'num_8.csv',
 'num_9.csv']

### Concat data together

In [7]:
#Now we can use dataframe concat to merge all data together
# df = pd.concat([df, tmp], ignore_index=True,)
df=pd.DataFrame()
for name in data_list:
    data = pd.read_csv(name)
    df = pd.concat([df, data], ignore_index=True,)
df.head()

   num  times 2  times 3  times 4
0    0        0        0        0
1    1        1        1        1
2    2        4        8       16
3    3        9       27       81
4    4       16       64      256

### Read xlsx

In [3]:
# Previous we learn can read csv file use pd.read_csv() and save to csv via pd.to_csv()
# You can also read excel file by pd.read_excel
excel_data = pd.read_excel('num_0.xlsx', sheet_name='num_0')
excel_data

   num  times 2  times 3  times 4
0    0        0        0        0

In [15]:
#and you can also save to excel
excel_data.to_excel("output.xlsx", sheet_name='Sheet_Name', index=False)

### Edit dataframe column name

In [78]:
print(f'You can check column names by df.columns: \n{df.columns}')
#To change column name, you can use
df.columns = ['times 1', 'times 2', 'times 3', 'times 4',]
print(f'Check column name again: df.columns: \n{df.columns}')
#Or you can change by rename for just certain columns in a dictionary form
df = df.rename(columns={'times 1':'num'})
print(f'Check column name again: df.columns: \n{df.columns}')

You can check column names by df.columns:
Index(['num', 'times 2', 'times 3', 'times 4'], dtype='object')
Check column name again: df.columns:
Index(['times 1', 'times 2', 'times 3', 'times 4'], dtype='object')
Check column name again: df.columns:
Index(['num', 'times 2', 'times 3', 'times 4'], dtype='object')

### drop columns

In [22]:
df.drop(['num'],axis=1).head()

   times 2  times 3  times 4
0        0        0        0
1        1        1        1
2        4        8       16
3        9       27       81
4       16       64      256

### Select by condition

In [27]:
#You can use one column to perform some judgement, and will return a True/False type data, so we can use this to filter the df
df['num']>5

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7     True
8     True
9     True
Name: num, dtype: bool

In [28]:
#Only True data will appear
df[df['num']>5]

   num  times 2  times 3  times 4
6    6       36      216     1296
7    7       49      343     2401
8    8       64      512     4096
9    9       81      729     6561

In [31]:
#Also, we can use isin list to select
df['num'].isin([1,3,4])

0    False
1     True
2    False
3     True
4     True
5    False
6    False
7    False
8    False
9    False
Name: num, dtype: bool

In [32]:
df[df['num'].isin([1,3,4])]

   num  times 2  times 3  times 4
1    1        1        1        1
3    3        9       27       81
4    4       16       64      256

### merge data

In [82]:
#merge data means you had two dataset with columns had same value that can form a correlation
id_df = pd.DataFrame({'id':[1,2,3,4,5],'fruit for sale':['Sell:apple','Sell:orange','Sell:banana','Sell:orange','Sell:apple']})
print(f'Assume you had a id list of some fruit: \n{id_df}')
price_df = pd.DataFrame({'id':[1,2,3,4,5],'price':[5,10,15,13,55]})
print(f'And price list of fruit: \n{price_df}')
#We can use merge to create connection on two list
merge_df = id_df.merge(price_df,left_on='id', right_on='id')
print(f'Data after merge: \n{merge_df}')

Assume you had a id list of some fruit:
   id fruit for sale
0   1     Sell:apple
1   2    Sell:orange
2   3    Sell:banana
3   4    Sell:orange
4   5     Sell:apple
And price list of fruit:
   id  price
0   1      5
1   2     10
2   3     15
3   4     13
4   5     55
Data after merge:
   id fruit for sale  price
0   1     Sell:apple      5
1   2    Sell:orange     10
2   3    Sell:banana     15
3   4    Sell:orange     13
4   5     Sell:apple     55

In [72]:
### Extract content from column
#You can see column 'fruit for sale' is not very clean, contains Sell: in front, so we can use split(':') to get only fruit name
#Below could both works
# merge_df['fruit']=merge_df['fruit for sale'].str.split(':').str[0]

merge_df['fruit']=[x.split(':')[0] for x in merge_df['fruit for sale']]
"""
Above is list comprehension
Same method as 
tmp = []
for x in merge_df['fruit for sale']:
    data = x.split(':')[0]
    tmp.append(data)
merge_df['fruit']=tmp
"""

In [39]:
#Now we had a purchase record on id, there will be duplicated id list
purchase = pd.DataFrame({'id':[1,2,5,4,2,3,1,5,4,2,3,1,5,4], 'purchase_qty':[1,2,3,4,5,6,7,8,9,10,11,12,13,14]})
#If you don't know the content you can use drop_duplicates
purchase['id'].drop_duplicates()

0    1
1    2
2    5
3    4
5    3
Name: id, dtype: int64

In [40]:
#And you can use sort_values to arrange data
purchase['id'].drop_duplicates().sort_values()

0    1
1    2
5    3
3    4
2    5
Name: id, dtype: int64

In [53]:
#Aggregate based on features min,max,sum,count
purchase_new = purchase.groupby(['id']).sum().reset_index()
purchase_new

   id  purchase_qty
0   1            20
1   2            17
2   3            17
3   4            27
4   5            24

### Question: What will be the income per id